["#DropThePants & Don the Shorts\nGet a COOL 15% XTRA DISCOUNT on 2 Shorts or Linen Shirts @ fbb & Big Bazaar\nUse 8832124721 till 23 Apr\nRange @ bit.ly/2ouve2s\nTC", "Specially for you this weekend at CENTRAL. FLAT Rs 250 OFF on purchase of Rs 2000 using code 9242633254 + FLAT 50% OFF on over 200 brands!Valid 16 & 17 July.TnC", "PANTALOONS announces Post GST savings! MRP FURTHER REDUCED on Mens, Womens & Kidswear. FLAT 50% OFF SALE continues. Click bit.ly/2uamORO. TC", "PANTALOONS Midnight Shopping Extravaganza @South City Mall. Shop from 10pm -12 Midnight & get FREE Parking, Domino's Vouchers, Snacks & EXCLUSIVE Midnight Offers. Shop & get Samsung LED TV worth Rs 14,900, Skybags Trolley bag worth Rs 5830, Borosil 26 pcs Dinner Set worth Rs 3499 Absolutely FREE. TC", "Don't snooze..Make the most of the last weekend of sale and grab FLAT 50% OFF GAP, U.S. Polo Assn., Aeropostale, Arrow & more today! https://goo.gl/J9nTfk\n", "Flat 70% OFF + Extra 15% OFF\n+ Extra Cashback. Last chance to \nmake the most of Right to Fashion\nSale! Shop Now! http://smse.in/d059/gGcmDh", "Exclusive Diwali Offer for Celio fantastic members! Use code DIW108056 to get Rs. 2000 off on purchase of Rs. 7000 or more at Celio stores. Valid till 8-Oct.T&C", "#JustJeansDays @ CENTRAL. EXTRA 20% OFF on existing offer on Jeans frm brands like Jack & Jones, Lee, Lee Cooper & more. 3-4 June only. Use code 6718305083. TnC", "Strap on Your Seat-Belts for a #SuperSaturday. Enjoy Flat 50% OFF at KOOVS.COM. Use Code ALL50, Hurry! Shop Now -https://goo.gl/DcssQ8", "Valentine's Special! Extra 14% Off + 14% cashback on everything. Gift Voucher- VALENTINE @ w.lenskart.com/s/rJH8nd/lipPYK or find store at lenskart.com/storen", "On your Mark-Get Set-SHOP!\nGrab FLAT 40% OFF on UCB l NIKE l U.S.Polo.& more! Happy Shopping ;)\nhttp://msg.mn/Yd_12N", "ONLY for you from Levi's! We are giving you FLAT Rs.750 OFF on purchase of any Levi's jeans until 27-Aug ONLY at our exclusive Levi's stores ! T&C.", "The End of Season Sale is still on! Shop and avail FLAT 50% OFF at exclusive Parx stores. Hurry! T&C apply.", "Don't MISS OUT on MARKS & SPENCER'S Mid-Season Sale! Get up to 50% OFF at your nearest store! Additional 10% cashback on Axis Bank & HSBC cards. T&C.", "PANTALOONS announces Greencard pre-GST PREVIEW SALE 16-18 Jun! Upto 50% OFF across apparel, accessories, footwear. PLUS upto 10% CASHBACK on ewallets/cards. TC", "Max Fashion Exclusive Online offer! Upto 20% off + Extra Rs200 off on Rs.1999! Shop Online at Maxfashion.com Use Code-FLAT200 - offer valid on website only"]